/*==================================================================================================
	MS2022
	[cube.h]
	・キューブ
----------------------------------------------------------------------------------------------------
	2021.10.11 @Author HAYASE SUZUKI
====================================================================================================
	History
		211011 作成

/*================================================================================================*/
#pragma once

#include "game_object.h"
#include "model.h"
#include "shader.h"

// キューブクラス（ゲームオブジェクト）
class CCube : public CGameObject {
private:
	CModel* m_Model;

	CShader* m_Shader;

public:
	/*CCube();
	~CCube();*/

	void Init();
	void Uninit();
	void Update();
	void Draw();

};