/*==================================================================================================
	MS2022
	[stage.h]
	・ステージ　外観
----------------------------------------------------------------------------------------------------
	2021.10.18 @Author OTA KANAME
====================================================================================================
	History
		211018 作成

/*================================================================================================*/
#pragma once

#include "game_object.h"
#include "model.h"
#include "shader.h"

// キューブクラス（ゲームオブジェクト）
class CStage : public CGameObject {
private:
	CModel* m_Model;

	CShader* m_Shader;

public:

	void Init();
	void Uninit();
	void Update();
	void Draw();

};